{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Full Stack Python Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Versatile Full Stack Developer with Bachelor's in Informatics, specializing in Python backend development, API integration, and AI/ML solutions. Experienced in building scalable web applications, database integrations, and deploying machine learning models using Python, OpenAI APIs, and DevOps practices including Docker and CI/CD pipelines.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Engineered backend and AI-powered solutions using Python and APIs, collaborating with cross-functional teams including data science to deploy machine learning models and support data-driven features.","highlights":["Developed and deployed AI-powered browser extension (AdCognition) using TypeScript, TensorFlow.js, and OpenAI API for real-time data processing and integration","Built RoboGPT, an extension for Nvidia Isaac Sim using Python, LLMs, and OpenAI APIs to enable natural language control of robots, emphasizing scalable backend integrations and API handling","Led frontend refactoring of exam management platform using Vue.js and Vuetify, optimizing database interactions and improving load times by 25% through efficient query construction","Participated in code reviews, applied agile methodologies, and collaborated with UI/UX and analytics teams to ensure secure and maintainable application development"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed to full-stack development of AdsMedia retargeting platform, focusing on backend API integrations and frontend components using modern frameworks.","highlights":["Architected and developed key backend services and RESTful APIs for campaign management, ensuring seamless data flow and secure authentication mechanisms","Implemented responsive frontend dashboard and form components using Nuxt.js, Vue.js, and TypeScript, with emphasis on cross-browser compatibility and user authentication","Collaborated with backend team on system design, database integrations, and end-to-end testing to accelerate development across projects"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation tools using Python and JavaScript to enhance operational efficiency while providing customer support.","highlights":["Designed and implemented Otis, a Python and JavaScript-based templating tool for automating form-filling, data validation, and email generation, improving team productivity and data integrity","Applied problem-solving skills in cross-functional collaboration, contributing to innovation in secure coding and process automation"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Provided customer support while developing innovative automation solutions.","highlights":["Won 1st place in a company-wide Innovation contest by developing Otis, a JavaScript-based templating software that automated form-filling and email generation, significantly improving team efficiency","Honed communication, teamwork, and problem-solving skills while interacting with customers from diverse cultures"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a templating software automating data processing and generation, enhancing backend efficiency and security"}],"certificates":[{"name":"Cybersecurity Essentials","date":"2022-04","url":"https://www.credly.com/badges/df12a1d2-d3bb-4ea9-ab2f-55d56f94d81c/linked_in_profile","issuer":"Cisco"}],"skills":[{"name":"Backend & AI/ML","level":"Intermediate","keywords":["Python","OpenAI API","TensorFlow.js","MongoDB","RESTful APIs","Asynchronous Request Handling"]},{"name":"Frontend Development","level":"Advanced","keywords":["HTML5","CSS3","JavaScript (ES6+)","TypeScript","Vue.js","React.js"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Docker","CI/CD","Linux"]},{"name":"Databases","level":"Intermediate","keywords":["MongoDB"]},{"name":"Frameworks","level":"Intermediate","keywords":["Express.js","Node.js"]}],"projects":[{"name":"defender-bot","description":"Developed a Python-based LEGO Mindstorms robot using Micropython, focusing on backend control logic, sensor data integration, and OOP principles for scalable application development.","highlights":["Designed and implemented backend modules for robot control and data processing using Python, emphasizing reusable code and secure data handling","Built and optimized query-like interactions for sensor data, applying data validation and integrity checks","Demonstrated proficiency in Python scripting for robotics applications, supporting complex data requirements"],"keywords":["Python","Micropython","RESTful APIs","OOP","Database Integration"],"roles":["Developer"],"type":"application"},{"name":"RoboGPT","description":"Created an Nvidia Isaac Sim extension using Python and OpenAI APIs for natural language processing and robot control, integrating LLMs for backend AI features.","highlights":["Architected backend services with Python to handle API calls to OpenAI, ensuring secure authentication and asynchronous request handling","Collaborated on data layer solutions for machine learning model deployment, focusing on scalable integrations and data governance","Implemented reusable modules for natural language command processing, supporting rapid iteration on data-driven features"],"keywords":["Python","OpenAI API","LLMs","RESTful APIs","Machine Learning","Asynchronous Handling"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"AdCognition","description":"Engineered an AI-powered browser extension for real-time ad detection using Python-compatible TensorFlow.js and APIs.","highlights":["Developed backend logic for data validation and sanitization in AI models, ensuring security and reliability","Integrated authentication mechanisms and optimized query construction for ad data processing","Supported cross-functional teams in deploying ML models for analytics and feature iteration"],"keywords":["Python","TensorFlow.js","OpenAI API","AI/ML","Data Validation"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media application using MERN stack, with focus on backend API development and database integration.","highlights":["Built backend services using Node.js, Express.js, and MongoDB for user authentication and data management","Defined RESTful API contracts and implemented secure data handling for end-to-end integration","Applied agile practices in development, including code reviews and testing for maintainable solutions"],"keywords":["Node.js","Express.js","MongoDB","RESTful APIs","OAuth2"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based automation tool for form-filling and email generation, emphasizing data integrity and efficiency.","keywords":["JavaScript","RegEx","Automation","Data Validation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}