{"basics":{"name":"Daniel Ilies","label":"Full-Stack Engineer | NestJS • Next.js • PostgreSQL • Data Pipelines","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Full-Stack Engineer with 3+ years delivering production web applications, data pipelines, and analytics tools. Proven expertise in NestJS, Next.js, PostgreSQL, ETL workflows, and event tracking systems (Segment, Mixpanel). Built analytics dashboards, automated data flows, and optimized schemas for campaign tracking and user analytics. Self-driven, remote-ready, and fluent in English—thrives in asynchronous, distributed teams.","location":{"address":"Deira","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"BigFoot Company","location":"Germany (remote)","position":"Full-Stack Engineer (Contract)","startDate":"2023-11","endDate":"2024-10","summary":"Led full-stack development for a Telegram advertising and analytics platform, building ETL pipelines, data models, and dashboards for campaign tracking and user retargeting.","highlights":["Architected PostgreSQL schemas and optimized relational data models for campaign analytics, user interactions, and event tracking.","Built analytics dashboards with Next.js and TypeScript enabling clients to create, manage, and analyze multi-channel campaigns.","Developed automated Telegram bot system for campaign broadcasting and user retargeting—integrated real-time event tracking and personalized messaging.","Implemented backend APIs with Node.js and Express supporting campaign workflows, real-time statistics, and analytics endpoints.","Managed remote Linux server deployments, CI/CD pipelines, and Docker-based infrastructure for reliability and uptime."]},{"name":"DevelBox","location":"Romania (remote)","position":"Software Developer (Contract)","startDate":"2021-12","endDate":"2023-09","summary":"Delivered full-stack applications, data-driven prototypes, and analytics tools for B2B clients. Led frontend modernization and built data pipelines supporting ML/AI experiments.","highlights":["Modernized UMF Exams platform: migrated frontend to Vue.js + Vuetify, enabling 50% faster feature delivery and improved accessibility—integrated with existing backend systems.","Built data collection and processing pipelines for AI prototypes using Python/Flask, managing integration, deployment, and monitoring.","Developed analytics workflows and data visualization tools for internal experimentation and client reporting.","Implemented event tracking and debugging workflows for ML-driven applications, ensuring data accuracy and pipeline reliability.","Awarded 1st Place Innovation for internal automation tool that streamlined workflows and reduced manual overhead."]},{"name":"Trood","location":"Remote","position":"Full-Stack Engineering Intern","startDate":"2021-07","endDate":"2021-10","summary":"Contributed to backend services and API integrations in a multi-service environment.","highlights":["Developed backend components and API endpoints for inter-service communication.","Implemented data models and serialization flows across distributed services."]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9.0/10"}],"awards":[{"title":"1st Place Innovation Contest","date":"2023-01","awarder":"CGS Romania","summary":"Awarded for automation tool that streamlined internal workflows and improved team efficiency."}],"skills":[{"name":"Full-Stack Development","level":"Advanced","keywords":["NestJS","Next.js","Node.js","Express.js","TypeScript","JavaScript","Vue.js","React.js","Tailwind CSS"]},{"name":"Data & Analytics","level":"Advanced","keywords":["PostgreSQL","Prisma","ETL Pipelines","Data Warehousing","Event Tracking","Segment","Mixpanel","Analytics Dashboards","Cohort Analysis","Funnel Optimization"]},{"name":"Backend & Infrastructure","level":"Intermediate","keywords":["REST APIs","Event-Driven Architecture","Python","Flask","Docker","CI/CD","Linux","Git"]}],"languages":[{"language":"English","fluency":"Proficient"},{"language":"Romanian","fluency":"Native"},{"language":"Russian","fluency":"Native"}],"projects":[{"name":"Analytics & ETL Pipeline for Campaign Platform","description":"Built end-to-end data pipelines and analytics dashboards for a Telegram advertising platform—integrated event tracking, PostgreSQL data warehousing, and real-time campaign metrics.","highlights":["Designed PostgreSQL schemas optimized for analytics queries, event tracking, and cohort analysis.","Implemented ETL workflows integrating multiple data sources into centralized analytics warehouse.","Built real-time dashboards enabling funnel analysis, campaign performance tracking, and user segmentation."],"startDate":"2023-11","endDate":"2024-10"},{"name":"Event Tracking & Data Debugging for ML Platform","description":"Developed data collection pipelines and event tracking workflows for AI-powered applications—ensured data accuracy and integrated analytics tools.","highlights":["Built Python/Flask services for data ingestion, event logging, and experiment tracking.","Debugged event tracking discrepancies and optimized data flows for ML model training.","Integrated analytics tools for cohort tracking and experiment monitoring."],"startDate":"2022-12","endDate":"2023-09"}]}