{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Frontend Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"A highly skilled Frontend Developer with 3+ years of experience in building performant, accessible, and scalable user interfaces using React, JavaScript, TypeScript, HTML5, and CSS3. Proficient in developing responsive UIs, optimizing applications for speed and scalability, and collaborating with designers and backend engineers to deliver polished features. Experienced in modern build tools, RESTful APIs, asynchronous request handling, and ensuring cross-browser compatibility.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led frontend development of user-facing features using Vue.js and TypeScript, collaborating with UI/UX designers and backend developers to implement responsive and accessible UIs while optimizing for speed and scalability.","highlights":["Led the frontend refactoring of an exam management platform using Vue.js and Vuetify, implementing responsive design and ensuring cross-browser compatibility to improve user experience and page load times by approximately 25%","Developed clean, modular, well-tested code for AI-powered browser extension using TypeScript, handling asynchronous requests and RESTful APIs for real-time functionality","Actively participated in code reviews, mentored junior developers, and collaborated with cross-functional teams to ensure technical feasibility of UI/UX designs"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Served as primary frontend developer building high-quality user interfaces with Nuxt.js, Vue.js, and TypeScript, focusing on performant and scalable features while integrating with backend APIs.","highlights":["Architected and developed key dashboard and form components for campaign management, writing clean, modular code and optimizing applications for speed and scalability","Implemented responsive design principles and ensured cross-browser compatibility, delivering elegant UIs that provide seamless user experiences across devices","Collaborated closely with backend team on API integration, handling asynchronous request handling for smooth data flow and application functionality"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation solutions using JavaScript while honing problem-solving and communication skills in a collaborative environment.","highlights":["Developed Otis, a JavaScript-based templating software using clean code practices to automate form-filling and email generation, improving team efficiency","Demonstrated strong problem-solving skills and attention to detail through innovative solutions and customer interactions"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Provided customer support while developing innovative automation solutions.","highlights":["Won 1st place in a company-wide Innovation contest by developing Otis, a JavaScript-based templating software that automated form-filling and email generation, significantly improving team efficiency","Honed communication, teamwork, and problem-solving skills while interacting with customers from diverse cultures"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Won first place for developing Otis, a JavaScript-based templating software that automated form-filling and email generation"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["JavaScript (ES6+)","TypeScript","React","HTML5","CSS3","Responsive Design","Cross-Browser Compatibility"]},{"name":"Build Tools & Version Control","level":"Intermediate","keywords":["Git","Vite","Webpack"]},{"name":"Testing & APIs","level":"Intermediate","keywords":["RESTful APIs","Asynchronous Request Handling","Jest"]},{"name":"Backend & AI/ML","level":"Intermediate","keywords":["Node.js","Python","Express.js","MongoDB","TensorFlow.js","OpenAI API"]},{"name":"Development Tools","level":"Intermediate","keywords":["Docker","Linux","CI/CD"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"A full-stack social media application built with the MERN stack, focusing on developing high-quality user interfaces using React for performant and scalable experiences.","highlights":["Developed and maintained user-facing features using React, ensuring responsive design and cross-browser compatibility","Collaborated to implement elegant, accessible UIs by writing clean, modular, well-tested code with component-based architecture and state management using Redux","Optimized application for speed and scalability, handling asynchronous requests to RESTful APIs"],"keywords":["React","JavaScript","TypeScript","HTML5","CSS3","Responsive Design","Cross-Browser Compatibility","RESTful APIs","Asynchronous Request Handling"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application","image":"img/ithub.png"},{"name":"AdCognition","description":"An AI-powered browser extension for real-time ad detection and blocking, developed with TypeScript and modern frontend practices.","keywords":["TypeScript","JavaScript","TensorFlow.js","Browser Extension"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"A JavaScript-based internal tool for automating form-filling and email generation, emphasizing clean code and efficiency.","keywords":["JavaScript","Automation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}