{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"NodeJS Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Proficient NodeJS Developer with over 2 years of experience in designing, developing, and maintaining server-side applications using NodeJS and Express.js. Skilled in RESTful API development, MongoDB integration, and asynchronous JavaScript programming, with a focus on building scalable applications. Collaborate effectively with front-end developers using HTML, CSS, and JavaScript frameworks like Vue.js and React.js, while utilizing Git for version control and ensuring clean, maintainable code.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Developed and maintained server-side applications using NodeJS and Express.js, while leading frontend projects and integrating with databases like MongoDB.","highlights":["Developed high-quality server-side logic with NodeJS and asynchronous JavaScript, collaborating with front-end developers to integrate user-facing elements using Vue.js and Vuetify, resulting in improved user experience and 25% faster page load times","Built RESTful APIs and troubleshot applications for optimal performance, ensuring clean, maintainable, and efficient code","Participated in code reviews, contributed to team knowledge sharing, and utilized Git for version control to support collaborative development"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed to server-side development of the AdsMedia retargeting platform using NodeJS, while architecting front-end components with Nuxt.js, Vue.js, and TypeScript.","highlights":["Designed and developed server-side applications and services with NodeJS, integrating with front-end elements for seamless user experience across devices","Participated in the design and architecture of scalable applications, writing clean and efficient code while troubleshooting for optimal performance","Collaborated with the team using Git for version control, ensuring cross-functional integration and maintainable codebase"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation tools using JavaScript to enhance efficiency, while honing problem-solving and teamwork skills.","highlights":["Developed JavaScript-based templating software (Otis) for automating form-filling and email generation, improving team efficiency and winning 1st place in innovation contest","Troubleshot technical issues and applied problem-solving skills in diverse customer interactions, demonstrating strong communication and adaptability"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based templating software that automated form-filling and email generation, enhancing team productivity"}],"skills":[{"name":"Backend Development","level":"Intermediate","keywords":["Node.js","Express.js","RESTful API","JavaScript (ES6+ asynchronous programming)","MongoDB"]},{"name":"Frontend Technologies","level":"Advanced","keywords":["HTML5","CSS3","JavaScript frameworks (Vue.js, React.js)"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media application developed using NodeJS for server-side logic, RESTful APIs with Express.js, and MongoDB for database management.","highlights":["Developed high-quality server-side applications using NodeJS and Express.js to handle asynchronous operations and integrate user-facing elements","Designed RESTful APIs for backend services, ensuring scalable and maintainable code with MongoDB integration","Collaborated on frontend with React.js, utilizing component-based architecture and Redux for state management"],"keywords":["Node.js","Express.js","RESTful API","MongoDB","React.js","JavaScript"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based tool for automating form-filling and email generation, demonstrating proficiency in clean and efficient code.","keywords":["JavaScript","Automation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}