{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Full Stack Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Motivated Full Stack Developer with a Bachelor's degree in Informatics and over 3 years of experience in designing and implementing scalable web applications across front-end and back-end. Proficient in HTML, CSS, JavaScript frameworks like React and Vue.js, back-end technologies including Node.js and Python, RESTful API development, MongoDB databases, and Git version control. Experienced in collaborating with cross-functional teams to enhance performance, troubleshoot applications, and integrate APIs for robust user experiences.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Developer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Collaborated with cross-functional teams to design and implement scalable full-stack retargeting platform using Vue.js, Nuxt.js, TypeScript, focusing on front-end and back-end development for enhanced user experiences.","highlights":["Architected and developed key dashboard and form components for campaign management, ensuring high performance and responsiveness across platforms","Integrated APIs and ensured seamless data flow, troubleshooting and optimizing application functionality for scalability","Implemented responsive designs with HTML5, CSS3, and JavaScript frameworks to deliver cross-browser compatible web applications"]},{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Full Stack Developer","startDate":"2023-06","endDate":"2025-05","summary":"Engineered scalable web applications and AI-integrated solutions, creating robust back-end services and APIs while collaborating with teams to ship features and optimize performance.","highlights":["Led frontend development and refactoring of exam management platform using Vue.js, Vuetify, HTML, CSS, improving responsiveness and reducing page load times by 25%","Developed AdCognition browser extension with TypeScript, TensorFlow.js for real-time detection, integrating RESTful APIs and ensuring high performance","Built RoboGPT extension using Python, Node.js, OpenAI APIs, and MongoDB to support natural language processing, troubleshooting integrations and monitoring API stability"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Software Developer","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation tools using JavaScript to streamline processes, applying problem-solving skills in team environments.","highlights":["Created Otis JavaScript templating tool with RegEx for automating form-filling and email generation, enhancing efficiency and resolving functional issues","Collaborated on code reviews and UI implementations, utilizing Git for version control to maintain high-quality development practices"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based tool that automated support processes using APIs and scripting for enhanced team productivity"}],"skills":[{"name":"Front-End Technologies","level":"Advanced","keywords":["HTML5","CSS3","JavaScript (ES6+)","TypeScript","React.js","Vue.js","Nuxt.js"]},{"name":"Back-End Technologies","level":"Intermediate","keywords":["Node.js","Express.js","Python","RESTful API Development","MongoDB"]},{"name":"Development Tools & Databases","level":"Intermediate","keywords":["Git","Docker","CI/CD","MySQL","MongoDB"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media platform using MERN stack to demonstrate scalable application development with front-end and back-end integration.","highlights":["Designed and implemented dynamic UI features using React.js, HTML5, CSS3 for responsive web applications","Developed back-end services with Node.js, Express.js, and MongoDB, creating RESTful APIs to support front-end functionality and ensure high performance"],"keywords":["React.js","Node.js","Express.js","MongoDB","RESTful APIs","HTML5","CSS3"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for ad detection and blocking, focusing on front-end technologies and API integrations.","highlights":["Implemented real-time detection using TypeScript and TensorFlow.js, optimizing performance for seamless user experience","Integrated APIs and troubleshot issues to maintain application responsiveness across browsers"],"keywords":["TypeScript","TensorFlow.js","JavaScript","RESTful APIs"],"roles":["Full-Stack Developer"],"entity":"DevelBox","type":"application"},{"name":"RoboGPT","description":"Extension for Nvidia Isaac Sim using Python and APIs to control systems via natural language, emphasizing back-end services and integrations.","highlights":["Created robust back-end with OpenAI API and MongoDB for API development and data handling","Monitored and optimized API performance, collaborating to resolve integration issues"],"keywords":["Python","Node.js","OpenAI API","MongoDB","RESTful APIs"],"roles":["Full-Stack Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based automation tool for form-filling and email generation, awarded for innovation in process optimization.","highlights":["Developed scalable scripting with JavaScript and RegEx to automate tasks, improving efficiency","Troubleshot and debugged applications to ensure reliability and performance"],"keywords":["JavaScript","RegEx","Automation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}