{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Frontend Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Experienced Frontend Software Engineer proficient in modern JavaScript (ES6+), TypeScript, ReactJS, and browser APIs, with a focus on collaborating with product designers to prototype and implement elegant user experiences. Skilled in developing responsive, mobile-first web applications and ensuring code quality through testing techniques in fast-paced environments. Passionate about building scalable frontend solutions that drive meaningful impact, demonstrated through projects and professional experience in software development.","website":"https://daniel-iliesh.github.io","location":{"city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led frontend development projects using TypeScript and Vue.js, collaborating with UI/UX designers and backend teams to implement responsive features and maintain code quality.","highlights":["Collaborated closely with UI/UX designers to refactor and implement frontend features for an exam management platform using TypeScript, Vue.js, and Vuetify, enhancing user experience and reducing page load times by 25%","Developed an AI-powered browser extension (AdCognition) using TypeScript and TensorFlow.js, focusing on real-time interactions and browser APIs for ad detection and blocking","Prototyped and iterated on RoboGPT, an Nvidia Isaac Sim extension using OpenAI APIs, ensuring seamless integration and user interactions based on feedback"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.com/","startDate":"2025-01","endDate":"2025-06","summary":"Served as primary frontend developer in a fast-paced startup environment, building responsive dashboard components using modern JavaScript, TypeScript, and Vue.js ecosystem.","highlights":["Architected and developed key frontend components for the AdsMedia retargeting platform using Nuxt.js, Vue.js, and TypeScript, ensuring responsive design and cross-browser compatibility","Worked closely with backend team on API integrations and system design to deliver elegant solutions for campaign management, maintaining consistency in user interfaces","Prototyped new user interactions for dashboard features, incorporating feedback to enhance usability and performance in a high-growth setting"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Provided customer support while developing JavaScript-based automation tools to streamline processes in a team environment.","highlights":["Developed Otis, a JavaScript-based templating tool using modern JavaScript practices to automate form-filling and email generation, winning 1st place in company innovation contest and boosting team efficiency","Collaborated with team members to apply code quality principles and testing techniques in developing internal software solutions","Honed communication and organizational skills in a fast-paced, multicultural team setting"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Won first place for developing Otis, a JavaScript-based templating software that automated form-filling and email generation"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["JavaScript (ES6+)","TypeScript","ReactJS","Vue.js","HTML5","CSS3","Tailwind CSS","Vuetify"]},{"name":"Backend & AI/ML","level":"Intermediate","keywords":["Node.js","Python","Express.js","MongoDB","TensorFlow.js","OpenAI API"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Docker","Webpack","CI/CD"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media application built with MERN stack, emphasizing ReactJS for dynamic frontend development and responsive user experiences.","highlights":["Collaborated on design and implementation of frontend features using ReactJS and component-based architecture","Managed application state with Redux and ensured mobile-first responsive design across devices","Applied code quality principles and testing techniques to deliver scalable, user-focused interfaces"],"keywords":["ReactJS","TypeScript","MongoDB","Express.js","Node.js","Redux","Responsive Design"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection and blocking, developed using TypeScript and browser APIs.","highlights":["Implemented frontend logic with TypeScript and TensorFlow.js to handle user interactions and real-time processing","Prototyped and iterated on extension features based on user feedback, ensuring compatibility and performance","Focused on code quality and debugging to create a seamless, responsive experience in browser environments"],"keywords":["TypeScript","TensorFlow.js","Browser APIs","JavaScript (ES6+)"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based templating software for automating form-filling and email generation, awarded for innovation.","highlights":["Developed using modern JavaScript and RegEx to prototype efficient automation solutions","Collaborated with team to implement and test features, improving workflow in fast-paced operations"],"keywords":["JavaScript (ES6+)","RegEx","Automation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"},{"name":"RoboGPT","description":"Nvidia Isaac Sim extension enabling robot control via natural language using LLMs and OpenAI APIs.","highlights":["Integrated frontend elements for user interactions, prototyping with feedback to refine natural language interfaces"],"keywords":["OpenAI API","TypeScript","Natural Language Processing"],"roles":["Developer"],"entity":"DevelBox","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}