{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Proven Software Developer with experience in building and maintaining software applications using programming languages including JavaScript and TypeScript. Skilled in front-end technologies such as HTML, CSS, React, and Vue.js, with familiarity in database management using MongoDB and version control with Git. Strong problem-solving skills and ability to collaborate with cross-functional teams in developing scalable solutions.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Developed and maintained software applications as part of cross-functional teams, focusing on front-end development with JavaScript frameworks and integrating AI solutions.","highlights":["Led frontend development and refactoring of an exam management platform using Vue.js, HTML, and CSS, enhancing user experience and reducing page load times by 25%","Developed AI-powered browser extension AdCognition using JavaScript and TypeScript for real-time ad detection, demonstrating problem-solving in software design","Contributed to software architecture with RoboGPT extension using JavaScript integrations and APIs, collaborating on team-based development projects","Participated in code reviews and worked with UI/UX teams to implement front-end components aligned with design specifications"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Developer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed to developing and maintaining full-stack software applications for retargeting platform using JavaScript technologies, collaborating with development team.","highlights":["Served as primary front-end developer using Vue.js, HTML, and CSS to architect dashboard and form components for campaign management software","Ensured responsive design and cross-browser compatibility in front-end technologies, optimizing user experience across devices","Collaborated with back-end team on API integration and software design to maintain seamless application functionality and data flow"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Supported customer service operations while developing JavaScript-based automation tools to improve team efficiency in a collaborative environment.","highlights":["Developed Otis, a JavaScript-based templating software using HTML and CSS for automating form-filling and email generation, winning 1st place in company innovation contest","Applied problem-solving skills to create software solutions that enhanced workflow, demonstrating analytical abilities in development tasks"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based automation software that improved efficiency in form-filling and email generation for team collaboration"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["JavaScript (ES6+)","HTML5","CSS3","React.js","Vue.js","TypeScript"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Node.js","Express.js"]},{"name":"Backend & Database","level":"Intermediate","keywords":["MongoDB","Python"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack software application developed using React.js for front-end with HTML and CSS, integrated with MongoDB database, showcasing end-to-end development skills.","highlights":["Developed dynamic front-end features using React.js, HTML, and CSS in a component-based architecture for social media platform","Managed application state with Redux while ensuring compatibility and responsive design across devices","Collaborated on backend integration with Node.js and Express.js for complete software functionality"],"keywords":["React.js","HTML5","CSS3","MongoDB","JavaScript","Git"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application","image":"img/ithub.png"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based software tool for automating customer support tasks, developed using front-end technologies to streamline form and email processes.","keywords":["JavaScript","HTML","CSS","Git"],"roles":["Developer"],"entity":"CGS Romania","type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for ad detection, built with JavaScript and TypeScript front-end technologies.","keywords":["JavaScript","TypeScript","HTML","CSS"],"roles":["Developer"],"entity":"DevelBox","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}