{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Web Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Experienced Web Developer with a Bachelor's degree in Informatics, specializing in modern web applications using HTML, CSS, JavaScript, TypeScript, and component libraries like React and Vue.js. Proficient in building responsive user interfaces for diverse devices and browsers, with strong collaboration skills alongside UX designers and server-side developers. Demonstrated expertise in Git version control, web performance optimization, and full-stack development with Node.js and Python.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed to the development of modern web applications as a core team member, building the AdsMedia full-stack retargeting platform with Nuxt.js, Vue.js, and TypeScript.","highlights":["Served as primary front-end developer and supporting back-end developer, architecting and implementing key dashboard and form components using JavaScript components libraries for campaign management","Applied responsive user interface design principles with HTML, CSS, and TypeScript to ensure cross-browser compatibility and seamless experiences across a wide range of devices","Collaborated with back-end developers on system design and API integration, optimizing web performance in complex user interfaces and ensuring efficient data flow"]},{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led development of modern web applications and responsive user interfaces using Vue.js, TypeScript, and JavaScript, while integrating with server-side technologies like Node.js and Python.","highlights":["Directed frontend refactoring of an exam management platform (examene.umfst.ro/login) with Vue.js, Vuetify, HTML, and CSS, enhancing responsive design and reducing page load times by 25% for better web performance","Developed AdCognition, an AI-powered browser extension using TypeScript, TensorFlow.js, and JavaScript for real-time ad detection, ensuring compatibility across browsers and devices","Engineered RoboGPT, an extension utilizing Python, OpenAI APIs, and TypeScript for natural language processing in robotics, demonstrating interaction with server-side developers","Participated in code reviews and worked closely with UX designers to implement functional web pages from mockups, adhering to accessibility considerations"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Supported customer service operations while developing JavaScript-based tools to automate web-related tasks.","highlights":["Secured 1st place in company-wide innovation contest by creating Otis, a JavaScript application using jQuery for automating form-filling and email generation, improving efficiency in web-based processes","Developed skills in communication and collaboration, essential for interacting with UX designers and server-side developers in multidisciplinary teams"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript application that automates web form-filling and email generation using modern web standards"}],"skills":[{"name":"Web Development","level":"Advanced","keywords":["HTML","CSS","SCSS","JavaScript","TypeScript","React.js","Vue.js","Responsive User Interfaces","Git"]},{"name":"Server-Side & Tools","level":"Intermediate","keywords":["Node.js","Python","Linux","Docker","CI/CD","Web Performance"]},{"name":"Frontend Frameworks","level":"Advanced","keywords":["Nuxt.js","Vuetify","Tailwind CSS","JavaScript Components Libraries"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack modern web application using React.js, Node.js, Express.js, and MongoDB to demonstrate end-to-end development of responsive user interfaces.","highlights":["Architected dynamic frontend features with React.js, TypeScript compatibility, and component-based architecture for complex user interfaces","Managed application state with Redux, ensuring web performance and cross-browser compatibility across devices"],"keywords":["React.js","TypeScript","MongoDB","Express.js","Node.js","Redux","Responsive Design"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application","image":"img/ithub.png"},{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection using TypeScript and TensorFlow.js, focusing on responsive and performant web applications.","keywords":["TypeScript","TensorFlow.js","JavaScript","Browser Extension","Responsive User Interfaces"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based tool for automating web forms and emails, awarded for innovation in web development efficiency.","keywords":["JavaScript","jQuery","RegEx","Automation","HTML","CSS"],"roles":["Developer"],"entity":"CGS Romania","type":"application"},{"name":"RoboGPT","description":"Extension for Nvidia Isaac Sim enabling robot control via natural language with Python, OpenAI APIs, and TypeScript integration.","keywords":["Python","TypeScript","OpenAI API","Natural Language Processing","Server-Side Integration"],"roles":["Developer"],"entity":"DevelBox","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}