{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Experienced Software Engineer with demonstrated expertise in TypeScript and full-stack development, focused on architecting and building robust, scalable applications. Proven ability to innovate, solve complex problems, and deploy efficient desktop software solutions using advanced software architecture concepts. Committed to writing clean, maintainable code and collaborating with diverse teams to deliver high-quality software in dynamic environments.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Architected and developed robust frontend applications and AI-powered solutions using TypeScript, applying advanced software architecture concepts for scalable and efficient desktop-like extensions.","highlights":["Architected the frontend refactoring of an exam management platform using Vue.js and Vuetify, optimizing user experience and reducing page load times by 25% for improved performance","Built and deployed an AI-powered browser extension (AdCognition) utilizing TypeScript and TensorFlow.js to enable real-time ad detection and blocking, demonstrating expertise in developing scalable desktop software applications","Developed RoboGPT, an innovative Nvidia Isaac Sim extension leveraging TypeScript-compatible technologies, LLMs, and OpenAI APIs for natural language control of robots, showcasing creative problem-solving and code optimization","Collaborated with cross-functional teams including developers and UI/UX designers, conducting code reviews to ensure clean, maintainable, and high-quality code delivery"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.com/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed as a core developer to architect and build a full-stack retargeting platform using TypeScript, focusing on robust dashboard components and scalable application architecture.","highlights":["Served as primary front-end developer and supporting back-end contributor, architecting key dashboard and form components for campaign management using Nuxt.js, Vue.js, and TypeScript to create efficient, scalable solutions","Applied responsive design and cross-browser compatibility to deliver seamless user experiences, optimizing code for performance in dynamic environments","Collaborated with back-end team on system design and API integration, ensuring smooth data flow and robust application functionality while articulating technical concepts to stakeholders"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed innovative automation tools using JavaScript while honing collaboration and problem-solving skills in a team setting.","highlights":["Innovated Otis, a JavaScript-based templating software for automating form-filling and email generation, winning 1st place in company-wide innovation contest and enhancing team efficiency through clean, maintainable code","Demonstrated excellent communication skills by articulating technical solutions to non-technical team members and stakeholders from diverse backgrounds","Applied creative thinking to address complex customer support challenges, optimizing processes for precision and excellence"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based templating software that automated form-filling and email generation, highlighting innovation in software development"}],"skills":[{"name":"TypeScript & Frontend Development","level":"Advanced","keywords":["TypeScript","JavaScript (ES6+)","Vue.js","React.js","HTML5","CSS3"]},{"name":"Software Architecture & Backend","level":"Intermediate","keywords":["Node.js","Express.js","Advanced Software Architecture","Scalable Solutions"]},{"name":"AI/ML & Development Tools","level":"Intermediate","keywords":["TensorFlow.js","OpenAI API","Git","Docker","CI/CD"]}],"projects":[{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection and blocking, built with TypeScript to demonstrate expertise in developing robust desktop software applications.","highlights":["Architected and deployed using TypeScript and TensorFlow.js for efficient, scalable real-time processing","Applied advanced concepts to optimize performance and ensure clean, maintainable code"],"keywords":["TypeScript","TensorFlow.js","Browser Extension","AI","Desktop Applications"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"RoboGPT","description":"Nvidia Isaac Sim extension for controlling robots via natural language, utilizing LLMs and OpenAI APIs to innovate in software development.","highlights":["Developed innovative solution showcasing creative problem-solving and code optimization for complex challenges","Collaborated to integrate APIs, ensuring scalable and high-quality implementation"],"keywords":["TypeScript","Nvidia Isaac Sim","LLMs","OpenAI API","Natural Language Processing","Innovation"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based templating software that automated form-filling and email generation, awarded for excellence in innovation.","highlights":["Built robust automation tool to address efficiency challenges, applying clean code practices","Demonstrated commitment to quality and problem-solving in a collaborative environment"],"keywords":["JavaScript","Automation","Clean Code","Problem Solving"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}