{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Web Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Talented Web Developer with a Bachelor's degree in Informatics, proficient in front-end technologies including HTML5, CSS3, JavaScript, React.js, and Vue.js, and back-end technologies such as Node.js, Python, and MongoDB. Experienced in developing, maintaining, and enhancing responsive websites and web applications, optimizing performance for speed and scalability, integrating APIs, and ensuring cross-browser compatibility. Passionate about delivering secure, user-friendly web experiences with a focus on AI-driven solutions.","website":"https://daniel-iliesh.github.io","location":{"city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Developed and maintained responsive websites and web applications as a core team member using modern web technologies including Nuxt.js, Vue.js, and TypeScript.","highlights":["Developed interactive, dynamic, and user-friendly features for the AdsMedia full-stack retargeting platform, including key dashboard and form components for campaign management","Translated design mockups into fully functional websites, implementing responsive design principles and ensuring cross-browser compatibility for seamless user experiences on various devices","Collaborated with back-end developers on server-side components, API integration, and third-party services to optimize application performance for speed and scalability"]},{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led front-end and back-end development of web applications, incorporating AI solutions and ensuring seamless integration and functionality.","highlights":["Led front-end development and refactoring of an exam management web application using Vue.js and Vuetify, optimizing website performance and improving page load times by 25% while ensuring responsiveness on various devices","Developed and deployed AI-powered browser extensions using TypeScript and TensorFlow.js, integrating APIs for real-time functionality and user-friendly features","Engineered web extensions like RoboGPT using Python, Node.js, and OpenAI APIs, building interactive features for natural language processing and maintaining cross-browser compatibility"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Provided customer support and developed JavaScript-based tools to automate web processes and enhance efficiency.","highlights":["Developed Otis, a JavaScript-based templating software that automated form-filling and email generation, troubleshooting and debugging to ensure reliability","Collaborated with team members to implement user-friendly web automation features, honing problem-solving and communication skills in a fast-paced environment"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based web templating software that automated processes and improved efficiency"}],"skills":[{"name":"Front-End Technologies","level":"Advanced","keywords":["HTML5","CSS3","JavaScript","React.js","Vue.js","TypeScript","Responsive Design"]},{"name":"Back-End Technologies","level":"Intermediate","keywords":["Node.js","Python","Express.js","MongoDB"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Docker","CI/CD"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack web application demonstrating end-to-end development of responsive websites using modern web technologies.","highlights":["Developed responsive websites and web applications with dynamic front-end features using React.js and component-based architecture","Integrated back-end components with Node.js, Express.js, and MongoDB for seamless functionality and API integration","Optimized performance for speed and scalability while ensuring cross-browser compatibility"],"keywords":["React.js","Node.js","Express.js","MongoDB","Responsive Websites"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection and blocking, showcasing front-end development with AI integration.","highlights":["Built interactive web extensions using TypeScript and TensorFlow.js, ensuring responsiveness and user-friendly features","Integrated third-party AI services and optimized for performance across browsers","Conducted testing for cross-browser compatibility and security protocols"],"keywords":["TypeScript","TensorFlow.js","JavaScript","Browser Extension"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based web tool for automating form-filling and email generation, awarded for innovation in web development.","highlights":["Developed and maintained web automation features using JavaScript, jQuery, and RegEx to enhance user efficiency","Troubleshot and debugged issues to ensure reliability and seamless functionality"],"keywords":["JavaScript","Responsive Design","Automation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"},{"name":"RoboGPT","description":"Web extension for Nvidia Isaac Sim using LLMs and APIs to control applications via natural language, highlighting AI-driven web features.","highlights":["Developed interactive features with Python and OpenAI APIs for dynamic web applications","Ensured integration and optimization for scalability and user-friendly experiences"],"keywords":["Python","OpenAI API","Node.js"],"roles":["Developer"],"entity":"DevelBox","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}