{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Frontend Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Highly skilled Frontend Software Engineer with expertise in building responsive, scalable user interfaces using TypeScript, Tailwind CSS, and modern frontend frameworks like Vue.js and React.js. Experienced in integrating with RESTful APIs, optimizing performance, and collaborating in cross-functional teams to deliver high-quality applications. Based in Dubai, passionate about creating intuitive UIs and contributing to enterprise-level development.","website":"https://daniel-iliesh.github.io","location":{"city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led frontend development and collaborated with cross-functional teams including UX/UI designers and backend developers to build responsive interfaces and integrate with APIs.","highlights":["Led frontend refactoring of exam management platform using Vue.js and Vuetify, applying responsive design principles to improve user experience and reduce page load times by 25%","Developed reusable components and ensured maintainable UIs with utility-first design, focusing on performance optimization and cross-browser compatibility","Integrated frontend applications with backend services and APIs, participating in code reviews to maintain code quality and share knowledge","Engineered TypeScript-based AI-powered browser extension for real-time functionality, demonstrating proficiency in modern responsive UI development"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Served as primary frontend developer in a small cross-functional team, designing and implementing responsive UIs with TypeScript and modern frameworks while integrating with backend services.","highlights":["Architected and developed key dashboard and form components using Nuxt.js and Vue.js, building scalable and performant interfaces aligned with best practices","Implemented responsive, maintainable UIs ensuring seamless user experience across devices, with focus on modular component development","Collaborated with backend developers on API integration and system design to support efficient data flow and application functionality"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation tools using JavaScript to improve efficiency while honing teamwork and communication skills in a diverse environment.","highlights":["Developed JavaScript-based templating software (Otis) to automate form-filling and email generation, enhancing team productivity and winning 1st place in company innovation contest"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based automation tool that streamlined form-filling and email generation processes"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["TypeScript","Tailwind CSS","JavaScript (ES6+)","Vue.js","React.js","HTML5","CSS3","Responsive UI Development"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","CI/CD","Docker"]},{"name":"API Integration","level":"Intermediate","keywords":["RESTful APIs"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media application with dynamic frontend features, built using React.js and component-based architecture for responsive UIs.","highlights":["Designed and developed responsive UIs using React.js, managing state with Redux for scalable applications","Integrated with backend services via RESTful APIs to enable efficient data handling"],"keywords":["React.js","TypeScript","Responsive UI","RESTful APIs","Component-Based Architecture"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection using TypeScript, focusing on performant frontend implementation.","keywords":["TypeScript","Tailwind CSS","Browser Extension","RESTful APIs"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based tool for automating UI interactions like form-filling, developed with reusable code for efficiency.","keywords":["JavaScript","Responsive UI","Automation"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}