{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Frontend Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Experienced Frontend Software Engineer with expertise in building responsive, maintainable UIs using TypeScript, Tailwind CSS, Vue.js, and React.js. Skilled in integrating frontend applications with RESTful APIs, developing reusable modular components, and optimizing performance for scalable applications. Proficient in Git, CI/CD practices, and collaborating with cross-functional teams to deliver high-quality, secure frontend solutions.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led frontend development and refactoring projects, focusing on responsive UI design and integration with backend services using TypeScript and modern frameworks.","highlights":["Led frontend refactoring of an exam management platform using Vue.js and Vuetify to build responsive, maintainable UIs, improving user experience and page load times by 25%","Engineered and deployed an AI-powered browser extension using TypeScript for real-time functionality, ensuring modular components and cross-browser compatibility","Collaborated with UI/UX designers and backend developers to translate mockups into functional web pages, participating in code reviews for quality assurance"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Served as primary frontend developer, designing and implementing scalable dashboard and form components with responsive design principles and API integrations using Nuxt.js, Vue.js, and TypeScript.","highlights":["Architected and developed reusable, efficient modular components for campaign management dashboards, aligned with best practices for maintainable UIs using Tailwind CSS principles","Implemented responsive design and ensured cross-browser compatibility to deliver seamless user experiences across devices","Integrated frontend applications with backend services via RESTful APIs, collaborating with backend team on system design for smooth data flow"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation solutions using JavaScript while providing customer support, enhancing team efficiency through innovative tooling.","highlights":["Developed Otis, a JavaScript-based templating tool using RegEx for automating form-filling and email generation, improving efficiency and winning 1st place in company innovation contest","Collaborated in a team environment, honing communication and problem-solving skills for cross-functional contributions"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Won first place for developing Otis, a JavaScript-based templating software that automated form-filling and email generation, enhancing team productivity"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["TypeScript","Tailwind CSS","JavaScript (ES6+)","Vue.js","React.js","HTML5","CSS3"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","CI/CD","Webpack"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media application built with MERN stack, emphasizing dynamic frontend development with component-based architecture.","highlights":["Designed and developed responsive UIs with modular components using React.js, focusing on state management and performance optimization","Built reusable features using Redux for efficient state handling, ensuring scalable and maintainable application structure"],"keywords":["React.js","TypeScript","Modular Components","Responsive UI","State Management"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application","image":"img/ithub.png"},{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection and blocking, developed with TypeScript for performant frontend integration.","keywords":["TypeScript","Tailwind CSS","Browser Extension","RESTful APIs"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based internal tool for automating form-filling and email generation, developed to improve efficiency in support workflows.","keywords":["JavaScript","RegEx","Automation","Modular Components"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}