{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Frontend Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Experienced Frontend Software Engineer with over 2 years of frontend software development using JavaScript, HTML, CSS, TypeScript, and React.js to build high-performance web applications. Proficient in system design, research and development, and technological innovation for excellent user experience and high availability. Strong problem-solving skills in web-based system design, collaborating with product design, product management, and software engineering teams to drive efficiency and safety.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led frontend software development projects using JavaScript, TypeScript, and modern web technologies, collaborating with cross-functional teams to enhance system design and user experience.","highlights":["Led frontend refactoring of an exam management web application using JavaScript, TypeScript, and UI frameworks, improving high performance and user experience by 25%","Developed high-availability browser extension for web applications with TypeScript, ensuring excellent user experience through real-time detection features","Engaged in code reviews and collaborated with UI/UX teams to implement web-based system designs from complex mockups"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.com/","startDate":"2025-01","endDate":"2025-06","summary":"Served as primary frontend developer in international R&D team, participating in system design and development of web applications using TypeScript for global internal users.","highlights":["Architected and developed key frontend components for dashboard and campaign management web applications using JavaScript, HTML, CSS, and TypeScript, focusing on high performance and excellent user experience","Implemented responsive design and cross-browser compatibility in web-based systems to support high availability and seamless user experience across devices","Collaborated with backend team on API integration and system design to drive efficiency in web application functionality"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed innovative JavaScript solutions for automation while honing problem-solving skills in web-based system design.","highlights":["Developed JavaScript-based templating software for web automation, winning 1st place in company innovation contest by improving efficiency through high-performance form-filling and email generation","Applied problem-solving skills to create web tools that enhanced team productivity and user experience in internal systems"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Won first place for developing Otis, a JavaScript-based templating software that automated form-filling and email generation in web applications"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["JavaScript","HTML5","CSS3","TypeScript","React.js","Vue.js"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Webpack"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack web application with focus on frontend development using React.js for dynamic, high-performance user interfaces.","highlights":["Designed and developed frontend features using React.js, JavaScript, HTML5, and CSS3 to ensure high availability and excellent user experience","Implemented component-based architecture and state management for scalable web applications with strong system design principles"],"keywords":["React.js","JavaScript","HTML5","CSS3","TypeScript"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for real-time web ad detection, built with TypeScript for high-performance web applications.","keywords":["TypeScript","JavaScript","HTML5","CSS3"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based web automation tool for form-filling and email generation, demonstrating problem-solving in web-based systems.","keywords":["JavaScript","HTML5","CSS3"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}