{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Unity3D Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"A highly skilled Software Developer with a Bachelor's degree in Informatics, proficient in JavaScript scripting, AI/ML integration, cloud/REST APIs, and sensor workflows through robotics and 3D simulation projects. Experienced in troubleshooting code errors, performance optimization including memory and load times, transforming design ideas into functional software, and collaborating with design teams to deliver interactive solutions for desktop and mobile platforms.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Collaborated with cross-functional teams including designers to establish development pipelines, plan and implement AI-powered interactive solutions, transform design specifications into functional software, and optimize performance while troubleshooting code errors and bottlenecks.","highlights":["Engineered and deployed AdCognition, an AI-powered browser extension using TypeScript and TensorFlow.js for real-time ad detection and blocking, demonstrating knowledge of AI and optimization for desktop applications","Developed RoboGPT, an Nvidia Isaac Sim extension for 3D development and robot control via natural language commands, integrating AI/Navigation, scripting with LLMs, and cloud/REST APIs from OpenAI to ensure seamless functionality and session management","Led development projects focused on scripting, animation concepts through AI, and textures via simulation environments, actively troubleshooting issues and testing functionalities to meet high industry standards","Engaged in code reviews and worked with UI/UX designers to identify and fix errors, ensuring products conform to specifications and deliver interactive experiences"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Provided customer support while developing JavaScript-based automation tools to streamline workflows, demonstrating strong communication skills, troubleshooting, and attention to detail in identifying and fixing process bottlenecks.","highlights":["Identified workflow inefficiencies and designed Otis, a JavaScript-based templating software using jQuery and RegEx to automate form-filling and email generation, significantly improving team efficiency and conforming to operational standards","Honed troubleshooting skills and excellent attention to detail through daily problem-solving and code error identification in automation scripts","Demonstrated good communication skills by collaborating with diverse teams and translating requirements into functional software patches and upgrades"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed to full-stack development of interactive retargeting platform, focusing on planning functionality, API integration, and ensuring desktop and mobile compatibility while testing and optimizing for performance.","highlights":["Architected and implemented key dashboard and form components for campaign management using Nuxt.js, Vue.js, and TypeScript, transforming design ideas into functional software with REST API integration","Ensured cross-browser and device compatibility for seamless desktop and mobile experiences, including memory optimization and troubleshooting bottlenecks","Collaborated with back-end team to establish strategy, design system pipelines, and test functionalities, delivering high-standard interactive solutions"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Won first place for developing Otis, a JavaScript-based templating software that automated form-filling and email generation, showcasing skills in scripting, troubleshooting, and creating efficient interactive tools"}],"skills":[{"name":"Scripting and AI/ML","level":"Advanced","keywords":["JavaScript (ES6+)","TypeScript","Python","TensorFlow.js","OpenAI API","REST API","LLMs"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Docker","Linux","CI/CD","Nvidia Isaac Sim"]},{"name":"Robotics and Sensors","level":"Intermediate","keywords":["LEGO Mindstorms","MicroPython","Sensors","Electronics Workflows"]}],"projects":[{"name":"RoboGPT","description":"Planned and implemented an Nvidia Isaac Sim extension for 3D development, integrating physics, AI/Navigation, scripting, animation, and textures to transform natural language commands into functional robot control using LLMs and cloud/REST APIs from OpenAI, ensuring optimal session management and troubleshooting performance.","highlights":["Designed patches and upgrades for robot navigation and AI integration","Tested functionalities and dynamics in 3D simulation environment to meet high industry standards"],"keywords":["Nvidia Isaac Sim","LLMs","OpenAI API","Natural Language Processing","AI/Navigation","3D development"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"defender-bot","description":"Established strategy and developed a Python-controlled LEGO Mindstorms robot using MicroPython, demonstrating proficiency in electronics and sensor workflows, integrated physics, and troubleshooting for interactive robotics experiences in educational contexts.","highlights":["Transformed conceptual ideas into functional software with sensor integration and error fixing","Optimized robot performance and tested dynamics for reliable operation"],"keywords":["Python","LEGO Mindstorms","MicroPython","Robotics","Sensors","Electronics Workflows"],"roles":["Developer"],"type":"application"},{"name":"AdCognition","description":"Engineered an AI-powered browser extension for real-time ad detection and blocking using TypeScript and TensorFlow.js, focusing on memory and FPS optimization, scripting, and troubleshooting code errors for desktop and mobile compatibility.","highlights":["Implemented AI functionalities and fixed bottlenecks to ensure high-performance interactive features","Collaborated on design specifications to build and test ad management dynamics"],"keywords":["TypeScript","TensorFlow.js","Browser Extension","AI"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"Met with team to discuss specifications and developed an automation tool using JavaScript, jQuery, and RegEx to transform manual processes into functional software, identifying and fixing workflow errors while designing upgrades for efficiency.","highlights":["Ensured conformance to standards through rigorous testing and bottleneck resolution","Delivered interactive automation patches for retail and hospitality-like support scenarios"],"keywords":["JavaScript","jQuery","RegEx","Automation","Troubleshooting"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}