{"basics":{"name":"Daniel Ilies","label":"React JS Developer","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Full-Stack Engineer with 3+ years of experience building robust, high-performance web applications using React.js, Vue.js, and modern JavaScript frameworks. Proven track record delivering production-ready features with strong emphasis on component reusability, code quality, and performance optimization. Experience integrating security best practices and collaborating with cross-functional teams in fast-paced, distributed environments.","location":{"address":"Deira","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"BigFoot Company","location":"Remote, Germany","position":"Full-Stack Engineer","startDate":"2023-11","endDate":"2024-10","summary":"Led front-end development for Telegram advertising platform, building user-facing features and reusable React-based components.","highlights":["Developed intuitive web dashboards using React, TypeScript, and modern JavaScript (ES6+) for campaign management.","Built reusable UI components and front-end libraries optimized for performance across multiple browsers.","Translated wireframes and designs into high-quality, maintainable code following best practices.","Collaborated with backend team to integrate RESTful APIs and ensure seamless data flow.","Maintained code quality through regular code reviews and adherence to coding standards."]},{"name":"DevelBox","location":"Remote, Romania","position":"Software Developer","startDate":"2021-12","endDate":"2023-09","summary":"Delivered full-stack solutions with emphasis on React/Vue.js frontend development and RESTful API integration.","highlights":["Developed production Chrome extension with React.js achieving 90%+ accuracy in real-time feature detection.","Refactored and modernized university exam platform frontend using modern JavaScript frameworks, enabling 50% faster feature releases.","Built reusable component libraries and implemented state management solutions (Redux, Pinia).","Integrated authorization mechanisms including JSON Web Tokens for secure user authentication.","Optimized application performance across diverse web-capable devices and browsers.","Performed code reviews and maintained high code quality standards across projects."]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9.0/10"}],"skills":[{"name":"React.js & Core Principles","level":"Advanced","keywords":["React.js","JavaScript (ES6+)","TypeScript","JSX","Component Lifecycle","Hooks","Redux","State Management","DOM Manipulation"]},{"name":"Frontend Development","level":"Advanced","keywords":["HTML5","CSS3","Responsive Design","Performance Optimization","Cross-browser Compatibility","Webpack","Babel","NPM","RESTful APIs"]},{"name":"Security & Best Practices","level":"Intermediate","keywords":["JSON Web Token","Authorization Mechanisms","Code Reviews","Code Quality","Git","CI/CD"]}],"languages":[{"language":"English","fluency":"Proficient"},{"language":"Romanian","fluency":"Native"},{"language":"Russian","fluency":"Native"}],"projects":[{"name":"AdCognition – Production Chrome Extension","description":"Developed production-ready Chrome extension using React.js and modern JavaScript for real-time feature detection with 90%+ accuracy.","highlights":["Built reusable React components optimized for performance in browser environment.","Implemented secure data handling and modern authorization mechanisms.","Utilized Webpack, Babel, and NPM for efficient build and deployment pipeline.","Optimized for maximum performance across multiple browsers and devices."],"startDate":"2023-06","endDate":"2025-05"},{"name":"UMF Exam Portal Modernization","description":"Refactored legacy exam platform with modern JavaScript framework, implementing component-based architecture.","highlights":["Translated designs and wireframes into high-quality, maintainable code.","Built reusable component library for future feature development.","Integrated with existing RESTful APIs and backend services.","Delivered 50% faster feature release cycle through improved code architecture."],"startDate":"2022-12","endDate":"2023-02"}]}