{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Backend Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Highly skilled Backend Software Engineer with Bachelor's in Informatics, experienced in server-side development using Node.js and Python, building scalable full-stack applications, integrating AI/ML solutions, and optimizing systems for efficiency. Proficient in distributed systems components like MongoDB, Docker, and Linux troubleshooting to deliver high-performance solutions. Strong collaborator skilled in system design, API integration, and project management to enhance technical processes.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Engineered server-side solutions and AI-powered applications while contributing to system design and technical processes for efficient product delivery.","highlights":["Led development of AI-powered browser extension (AdCognition) using TypeScript, TensorFlow.js, and Node.js for real-time processing and integration with distributed systems","Developed RoboGPT extension with Python, OpenAI APIs, and LLMs to enable natural language control, optimizing for scalability and performance in simulation environments","Collaborated on requirement review, testing, and deployment using Docker and CI/CD pipelines to support monitoring and operation of production systems","Performed code reviews and system design with cross-functional teams to enhance team efficiency and technical atmosphere"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Contributed to server-side development of high-performance retargeting platform, focusing on scalable architecture and API integration for robust system functionality.","highlights":["Served as contributing backend developer, designing and implementing API endpoints with Node.js and Express.js to ensure high availability and data flow efficiency","Architected system design for distributed components, integrating cache and storage solutions to build scalable campaign management features","Collaborated on project management and testing communication to deliver high-quality, performant solutions across the product delivery cycle"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed automation tools to improve operational efficiency while honing communication and collaboration skills in diverse team environments.","highlights":["Engineered Otis automation software using JavaScript and scripting techniques to automate processes, significantly enhancing team productivity and system monitoring","Led innovation in templating and form generation, applying problem-solving with data structures to solve production issues independently"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based templating software that automated form-filling and email generation to enhance team efficiency"}],"skills":[{"name":"Backend Development","level":"Intermediate","keywords":["Node.js","Express.js","Python","MongoDB","Docker","Linux"]},{"name":"AI/ML Integration","level":"Intermediate","keywords":["TensorFlow.js","OpenAI API","LLMs"]},{"name":"Development Tools & Systems","level":"Intermediate","keywords":["Git","CI/CD","System Design","Distributed Storage"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack application with emphasis on server-side development using Node.js and Express.js for scalable data handling and API services.","highlights":["Developed backend architecture with MongoDB as distributed storage and Node.js for high-performance API endpoints and user management","Implemented scalable system design using Express.js to support dynamic content delivery and efficient database optimization"],"keywords":["Node.js","Express.js","MongoDB","System Design","Scalable Solutions"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application","image":"img/ithub.png"},{"name":"RoboGPT","description":"Nvidia Isaac Sim extension integrating AI/ML for natural language processing in robot control, using Python and OpenAI APIs for robust, scalable solutions.","keywords":["Python","OpenAI API","LLMs","Natural Language Processing","AI/ML"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"AdCognition","description":"AI-powered browser extension for real-time ad detection, leveraging TensorFlow.js and TypeScript for efficient, high-performance processing.","keywords":["TypeScript","TensorFlow.js","AI/ML","Browser Extension"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based automation tool for form-filling and email generation, improving efficiency through scripting and process optimization.","keywords":["JavaScript","Automation","Scripting","Efficiency Tools"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}