{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Front-end Software Engineer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Highly skilled Front-end Software Engineer with extensive experience in front-end design and client-side web applications using React.js, Vue.js, JavaScript, and TypeScript. Proven track record of launching great products through implementing responsive UIs, translating design prototypes to performant and cross-browser compatible code, and ensuring seamless user experiences with attention to quality and UX details.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Engineer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Served as primary front-end developer in a small team, implementing responsive UIs and client-side web applications for the AdsMedia retargeting platform using Vue.js, Nuxt.js, and TypeScript to meet high development standards.","highlights":["Architected and developed key dashboard and form components for campaign management, translating design prototypes into functional, performant, and cross-browser compatible code","Implemented responsive design principles to ensure seamless user experiences across desktop, mobile, and other devices","Collaborated with back-end team on API integration to build appealing interactive applications with smooth data flow"]},{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led front-end development initiatives, focusing on client-side web applications and translating complex mockups into high-quality, performant UIs using Vue.js and modern JavaScript tooling.","highlights":["Led frontend refactoring of an exam management platform using Vue.js and Vuetify, translating design prototypes to improve user experience and reduce page load times by 25%","Engineered a TypeScript-based browser extension for real-time functionality, ensuring cross-browser compatibility and obsession with quality in user interactions","Actively participated in code reviews and iterated on products using best industry practices to deliver simple and delightful web applications"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Developed JavaScript-based tools to automate processes, demonstrating strong understanding of JavaScript fundamentals while honing problem-solving skills.","highlights":["Developed Otis, a JavaScript-based templating tool using modern tooling to automate form-filling and email generation, launching a great product that improved team efficiency","Applied attention to detail and quality in building functional client-side solutions"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based templating tool that automated processes and launched a high-quality product"}],"skills":[{"name":"Frontend Development","level":"Advanced","keywords":["React.js","JavaScript (ES6+)","TypeScript","Vue.js","HTML5","CSS3","Responsive UIs","Cross-browser Compatibility"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Modern Tooling"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Full-stack social media web application with strong emphasis on front-end development using React.js to build dynamic, interactive client-side features.","highlights":["Implemented responsive UIs and dynamic frontend features using React.js component-based architecture","Translated design prototypes into performant code, managing application state with Redux for cross-browser compatible web apps"],"keywords":["React.js","JavaScript","Component-Based Architecture","Redux"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application"},{"name":"AdCognition","description":"TypeScript-based browser extension for real-time ad detection, showcasing client-side web application development with attention to UX and performance.","keywords":["TypeScript","JavaScript","Browser Extension"],"roles":["Developer"],"entity":"DevelBox","type":"application"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based automation tool for form-filling and email generation, demonstrating front-end scripting and quality-focused development.","keywords":["JavaScript","Modern Tooling"],"roles":["Developer"],"entity":"CGS Romania","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}