{"selectedTemplate":2,"headings":{},"basics":{"name":"Daniel Ilies","label":"Full-Stack Developer","image":"https://2.gravatar.com/avatar/d968116551f1fcd7a8498e06e731087f6847fa163eddd43f1428606fe999b284?size=512&d=initials","email":"iliesh.daniel@gmail.com","phone":"(+971) 54-753-6361","url":"https://danielilies.bio","summary":"Highly skilled Full-Stack Developer with Bachelor's degree in Informatics, experienced in front-end development using React.js and Cascading Style Sheets (CSS), and back-end web development with Node.js. Proficient in comprehensive full-stack development, building and managing software applications for efficient and effective software development tasks.","website":"https://daniel-iliesh.github.io","location":{"address":"Dubai","city":"Dubai","countryCode":"AE"},"profiles":[{"network":"GitHub","username":"daniel-iliesh","url":"https://github.com/daniel-iliesh"},{"network":"LinkedIn","username":"daniel-iliesh","url":"https://linkedin.com/in/daniel-iliesh"}]},"work":[{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led front-end development projects using React.js and back-end web development with Node.js, ensuring comprehensive full-stack development and efficient software development tasks in collaborative team environments.","highlights":["Led the frontend development of an exam management platform using React.js and CSS, enhancing user experience and reducing page load times by 25%","Developed software applications integrating back-end technologies like Node.js for API integration and data management","Collaborated with cross-functional teams on full-stack solutions, demonstrating strong problem-solving abilities and attention to detail"]},{"name":"Bigfoot Startup","location":"Remote, Germany","description":"Startup developing retargeting platforms","position":"Full-Stack Developer","url":"https://rocket-champ.pw/","startDate":"2025-01","endDate":"2025-06","summary":"Served as core full-stack developer building retargeting platforms with front-end development using React.js principles and back-end web development with Node.js, supporting efficient software application management.","highlights":["Acted as primary front-end developer using React.js and CSS for dashboard and form components in campaign management, ensuring responsive design and cross-browser compatibility","Contributed to back-end web development with Node.js for system design and API integration, enabling seamless data flow and application functionality","Collaborated in on-site-like remote team environment to deliver robust software applications with zero disruptions"]},{"name":"CGS Romania","location":"Remote, Romania","description":"Customer service outsourcing company","position":"Customer Service Representative","startDate":"2022-03","endDate":"2023-07","summary":"Supported customer service while developing automation tools using JavaScript for software development efficiency.","highlights":["Developed Otis, a JavaScript-based software application for automating form-filling and email generation, winning 1st place in innovation contest and improving team efficiency significantly","Applied problem-solving skills and attention to detail in collaborative settings to enhance operational software tasks"]},{"name":"DevelBox","location":"Iasi, Romania","description":"Software development company","position":"Software Developer","startDate":"2023-06","endDate":"2025-05","summary":"Led frontend development projects and engineered AI-powered solutions while collaborating with cross-functional teams.","highlights":["Led the frontend refactoring of an exam management platform (examene.umfst.ro/login) using Vue.js and Vuetify, improving user experience and page load times by approximately 25%","Engineered and deployed an AI-powered browser extension (AdCognition) using TypeScript and TensorFlow.js for real-time ad detection and blocking","Developed RoboGPT, an Nvidia Isaac Sim extension for controlling robots via natural language commands using LLMs and OpenAI APIs","Actively engaged in code reviews and collaborated with UI/UX designers to translate complex mockups into functional web pages"]}],"education":[{"institution":"University \"1 Decembrie 1918\" of Alba Iulia","area":"Informatics","studyType":"Bachelor's Degree","startDate":"2019-10","endDate":"2022-07","score":"9/10","gpa":"9 out of 10","courses":["Building a modern fullstack web application (Thesis)"]}],"awards":[{"title":"1st Place Innovation Contest","date":"2023","awarder":"CGS Romania","summary":"Awarded for developing Otis, a JavaScript-based templating software application that automated form-filling and email generation, enhancing efficiency in software development tasks"}],"skills":[{"name":"Front-End Development","level":"Advanced","keywords":["React.js","Cascading Style Sheets (CSS)","JavaScript (ES6+)","TypeScript","HTML5","CSS3"]},{"name":"Back-End Web Development","level":"Intermediate","keywords":["Node.js","Express.js","MongoDB"]},{"name":"Full-Stack Development","level":"Advanced","keywords":["React.js","Node.js","Software Development"]},{"name":"Development Tools","level":"Intermediate","keywords":["Git","Docker","CI/CD"]}],"projects":[{"name":"IT-Hub - MERN Stack Social Media Web Application","description":"Comprehensive full-stack social media application developed with React.js for front-end and Node.js for back-end web development, showcasing end-to-end software application building and management.","highlights":["Designed and implemented dynamic frontend using React.js and Cascading Style Sheets (CSS) for user interfaces","Developed back-end web components with Node.js and Express.js for efficient data handling and API management","Managed application state with Redux in a component-based architecture to ensure scalable software development"],"keywords":["React.js","Node.js","Express.js","MongoDB","Redux","Cascading Style Sheets (CSS)","Full-Stack Development"],"url":"https://github.com/daniel-iliesh/ithub","roles":["Full-Stack Developer"],"type":"application","image":"img/ithub.png"},{"name":"Otis – Customer Support Automation Tool","description":"JavaScript-based software application for automating customer support tasks, demonstrating software development expertise in efficient tool creation.","keywords":["JavaScript","Automation","Software Development"],"roles":["Developer"],"entity":"CGS Romania","type":"application"},{"name":"AdCognition","description":"Browser extension utilizing TypeScript for front-end development in real-time applications.","keywords":["TypeScript","Front-End Development"],"roles":["Developer"],"entity":"DevelBox","type":"application"}],"sections":["templates","profile","work","skills","projects","education","awards"]}